Tekla Open API Reference for Tekla Structures 2025
GraphicsDrawer.DrawLineSegment Method (LineSegment, Color)
 Draws a temporary line segment in the currently active rendered view.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DrawLineSegment(
	LineSegment LineSegment,
	Color Color
)
Public Function DrawLineSegment (
	LineSegment As LineSegment,
	Color As Color
) As Boolean
Parameters
LineSegment
Type: Tekla.Structures.Geometry3d.LineSegment
The line to draw.
Color
Type: Tekla.Structures.Model.UI.Color
The color of the line. The transparency value of the color is ignored.
Return Value
Type: Boolean
True on success.
See Also
Reference
GraphicsDrawer Class
DrawLineSegment Overload
Tekla.Structures.Model.UI Namespace